# RegisterUpdater Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UpdaterRegistry..::..RegisterUpdater Method
UpdaterRegistry Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RegisterUpdater(IUpdater) | Registers an updater application-wide, which means the updater may get triggered in any open document. |
| RegisterUpdater(IUpdater, Document) | Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document. |
| RegisterUpdater(IUpdater, Boolean) | Registers an updater application-wide, which means the updater may get triggered in any open document. |
| RegisterUpdater(IUpdater, Document, Boolean) | Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document. |

# See Also
UpdaterRegistry Class
UpdaterRegistry Members
Autodesk.Revit.DB Namespace